"""
# A. Автоматизация списка

## Ограничение времени

1 с

## Ограничение памяти

64.0 Мб

## Ввод

стандартный ввод или `input.txt`

## Вывод

стандартный вывод или `output.txt`

---

Привет!
Эти задачи направлены на отработку применения встроенных инструментов Python для генерации,
комбинирования и обработки коллекций.

Начнём с первой задачи. Не забывайте делать перерывы, если устали. Однако обязательно возвращайтесь к решению!

В жизни часто приходится составлять списки: продуктов, задач на день, дел.
Давайте автоматизируем это с помощью Python!

Напишите программу, которая превращает строку слов в нумерованный список — по одному элементу на строку.

## Формат ввода

Вводится одна строка.

## Формат вывода

Требуется вывести нумерованный список, составленный из её слов.
"""


print(*(f'{number}. {word}' for number, word in enumerate(input().split(), 1)), sep='\n')
