"""
# C. Рациональная считалочка

## Ограничение времени

1 с

## Ограничение памяти

64.0 Мб

## Ввод

стандартный ввод или `input.txt`

## Вывод

стандартный вывод или `output.txt`

---

Теперь потренируемся использовать бесконечные итераторы.
Напишите программу, которая выводит возрастающую последовательность чисел по заданным параметрам — началу, концу и шагу.

## Формат ввода

В одну строку через пробел вводятся 3 рациональных числа — начало счёта, конец и шаг.

## Формат вывода

Последовательность чисел с заданными параметрами и точностью не менее двух знаков после запятой.
"""


from itertools import count

start, end, step = map(float, input().split())

for number in count(start, step):
    if number >= end:
        break
    print(f'{number:.2f}')
