"""
# D. Словарная ёлка

## Ограничение времени

1 с

## Ограничение памяти

64.0 Мб

## Ввод

стандартный ввод или `input.txt`

## Вывод

стандартный вывод или `output.txt`

---

Попробуем применить итератор к строкам, а не к числам.
Напишите программу, которая превращает строку слов в «ёлку» — с каждой строкой список становится длиннее.

## Формат ввода

В одну строку вводятся слова, разделённые пробелом.

## Формат вывода

Несколько строк. В каждой следующей строке на одно слово больше.
"""


from itertools import accumulate

words_list = []
word = ''
for symbol in input():  # words_string
    if symbol == ' ':
        words_list.append(word)
        word = ' '
        continue
    word += symbol
words_list.append(word)

print(*accumulate(words_list), sep='\n')
