"""
# E. Список покупок

## Ограничение времени

1 с

## Ограничение памяти

64.0 Мб

## Ввод

стандартный ввод или `input.txt`

## Вывод

стандартный вывод или `output.txt`

---

Поход в магазин часто вызывает проблемы.
Если не подготовить список, можно уйти за хлебом, а вернуться с десятком пакетов.
Напишите программу, которая собирает пожелания семьи (мамы, папы и дочки) в единый список и приводит его в порядок.

## Формат ввода

В трёх строках записаны желаемые продукты (через запятую и пробел), без повторений.

## Формат вывода

Отсортированный по алфавиту список продуктов с нумерацией.

## Примечание

Помните, что итераторы можно применять к другим итераторам.
"""


from itertools import chain

strings_quantity = 3
strings_separator = ', '

shopping_list = sorted(chain.from_iterable([
    sorted(input().split(strings_separator))
    for _ in range(strings_quantity)
]))

for number, item in enumerate(shopping_list, 1):
    print(f"{number}. {item}")
