"""
# F. Колода карт

## Ограничение времени

1 с

## Ограничение памяти

64.0 Мб

## Ввод

стандартный ввод или `input.txt`

## Вывод

стандартный вывод или `output.txt`

---

Позади уже пять задач — вы хорошо справляетесь!

Пора сыграть в карты — но без одной из мастей.
Сгенерируйте колоду игральных карт (от двойки до туза), исключив масть, которую вводит пользователь.

## Формат ввода

Название масти, которая должна быть выброшена.
Передаётся в том же падеже, в котором она выводится на экран: «пик», «треф», «бубен» и «червей».

## Формат вывода

Список карт в колоде по увеличению номинала, затем масти (как в преферансе).
"""


from itertools import product

weights_tuple = tuple([str(weight) for weight in range(2, 11)] + ['валет', 'дама', 'король', 'туз'])
suits_tuple_initial = ('пик', 'треф', 'бубен', 'червей')

excluded_suit = input()

suits_tuple = tuple(suit for suit in suits_tuple_initial if suit != excluded_suit)

for weight, suit in product(weights_tuple, suits_tuple):
    print(weight, suit)
