"""
# I. Таблица умножения 3.0

## Ограничение времени

1 с

## Ограничение памяти

64.0 Мб

## Ввод

стандартный ввод или `input.txt`

## Вывод

стандартный вывод или `output.txt`

---

Местная фабрика канцелярских товаров заказала программу, которая генерирует таблицы умножения.
Давайте поможем производителю.

Напишите программу, которая выводит таблицу умножения размером N×N — построчно, по одному ряду на строку.

## Формат ввода

Вводится одно натуральное число — требуемый размер таблицы.

## Формат вывода

Таблица умножения заданного размера.
"""


from itertools import islice, product

size = int(input())

numbers = range(1, size + 1)
table = [x * y for x, y in product(numbers, repeat=2)]

for row_number in range(size):
    print(*islice(table, row_number * size, (row_number + 1) * size))
