"""
# L. Список покупок 2.0

## Ограничение времени

1 с

## Ограничение памяти

64.0 Мб

## Ввод

стандартный ввод или `input.txt`

## Вывод

стандартный вывод или `output.txt`

---

Давайте вновь поможем человеку с покупками.
Разработайте программу, которая объединяет пожелания семьи в один аккуратный список продуктов.

Соберите все элементы в общий список, отсортируйте его по алфавиту и пронумеруйте.

## Формат ввода

В первой строке задано натуральное число `N` — количество членов семьи.
В следующих `N` строках записаны желаемые продукты (через запятую и пробел), без повторов.

## Формат вывода

Отсортированный по алфавиту список продуктов с нумерацией.
"""


from itertools import chain

strings_separator = ', '

strings_quantity = int(input())

shopping_list = sorted(chain.from_iterable([
    sorted(input().split(strings_separator))
    for _ in range(strings_quantity)
]))

for number, item in enumerate(shopping_list, 1):
    print(f'{number}. {item}')
