"""
# M. Расстановка спортсменов

## Ограничение времени

1 с

## Ограничение памяти

64.0 Мб

## Ввод

стандартный ввод или `input.txt`

## Вывод

стандартный вывод или `output.txt`

---

Расстановка спортсменов на старте — дело несложное, если знать, как подойти к задаче.
Напишите программу, которая выводит все возможные расстановки участников, учитывая их имена.

## Формат ввода

В первой строке задано натуральное число `N` — количество спортсменов.
В следующих `N` строках записаны имена спортсменов.

## Формат вывода

Отсортированный по алфавиту список расстановок.
Имена в каждой строке выводить через запятую и пробел.
"""


from itertools import permutations

print_separator = ', '

names_quantity = int(input())
names_list = sorted([input() for _ in range(names_quantity)])

for names_tuple in permutations(names_list):
    print(*names_tuple, sep=print_separator)
