"""
# N. Спортивные гадания

## Ограничение времени

1 с

## Ограничение памяти

64.0 Мб

## Ввод

стандартный ввод или `input.txt`

## Вывод

стандартный вывод или `output.txt`

---

Хорошо, спортсмены расставлены на старте. Вот только угадать финалистов практически невозможно.
Давайте напишем программу, которая выводит список возможных победителей —
всех, кто может оказаться в числе призёров при любом раскладе.

## Формат ввода

В первой строке задано натуральное число `N` — количество спортсменов (не менее трёх).
В следующих `N` строках записаны имена спортсменов.

## Формат вывода

Отсортированный по алфавиту список вариантов.
Имена в каждой строке выводить через запятую и пробел.
"""


from itertools import permutations

print_separator = ', '
winners_quantity = 3

names_quantity = int(input())
names_list = sorted([input() for _ in range(names_quantity)])

for names_tuple in permutations(names_list, winners_quantity):
    print(*names_tuple, sep=print_separator)
