"""
# R. Таблица истинности

## Ограничение времени

1 с

## Ограничение памяти

64.0 Мб

## Ввод

стандартный ввод или `input.txt`

## Вывод

стандартный вывод или `output.txt`

---

Финиш близко — всего две задачи!
Вся современная электронно-вычислительная техника строится на Булевой алгебре,
которая оперирует истинностью и ложностью высказываний (в Python это `and`, `or`, `not`).

Разработайте программу,
которая для введённого логического выражения от переменных `a`, `b`, `c` строит таблицу истинности —
то есть перебирает все возможные комбинации значений и вычисляет результат.

## Формат ввода

Вводится логическое выражение от трёх переменных (`a`, `b`, `c`) валидное для языка Python.

## Формат вывода

Выведите таблицу истинности данного выражения.
"""


from itertools import product

table_header = 'a b c f'
triplets_iterator = product((False, True), repeat=3)

expression = input()

print(table_header)
print(*(f'{int(a)} {int(b)} {int(c)} {int(eval(expression))}' for a, b, c in triplets_iterator), sep='\n')
